app/views/artists/show.html.erb

  <strong>Songs:</strong>
  <%  @artist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 2]]