app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("created_at", "name", "record_label", "slug", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 17 Dec 2013 22:33:00 UTC +00:00], ["name", "Touch Me"], ["record_label", "Me"], ["slug", "touch-me"], ["updated_at", Tue, 17 Dec 2013 22:33:00 UTC +00:00]]

    def set_artist
      @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? ORDER BY "artists"."id" ASC LIMIT 1  [["id", 2]]