app/controllers/songs_controller.rb

  def make_songs
    3.times do |i|
      Song.create(:title=>"new song #{i}")
    end
    render :partial => 'song_list', locals: {songs: Song.all}
---
INSERT INTO "songs" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 13 Dec 2013 02:57:54 UTC +00:00], ["title", "new song 0"], ["updated_at", Fri, 13 Dec 2013 02:57:54 UTC +00:00]]
SELECT "songs".* FROM "songs"

  def create
    @song = Song.new(song_params)
    ##Could do it like this but this is goofy
    #@artist = Artist.new(params[:song][:artist_name])
    #if(Artist.find....)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("artist_id", "created_at", "genre_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist_id", 1], ["created_at", Tue, 10 Dec 2013 20:57:05 UTC +00:00], ["genre_id", 1], ["title", "Yonkers"], ["updated_at", Tue, 10 Dec 2013 20:57:05 UTC +00:00]]